[
    {
        "title": "สมาชิก Starbucks® Rewards รับโบนัสดาวเพิ่ม 15 ดวง เมื่อซื้อเครื่องดื่มสตาร์บัคส์ (ขนาด 12 ออนซ์ขึ้นไป) คู่กับขนมเค้กหรือแซนด์วิช",
        "link": "https://www.starbucks.co.th/th/promotions/sr-15-bonus-stars-when-buy-beverage-12oz-oct-24/",
        "image": "https://www.starbucks.co.th/stb-media/2024/10/Digital-Promotion-SR-Get-15-Bonus-Stars-Autumn-24-Website-Banner-Promotion-1080x640-1-675x400.webp",
        "date": "4 ต.ค. 67",
        "details": [
            "4 ต.ค. 67",
            "• สิทธิประโยชน์สำหรับสมาชิก Starbucks® Rewards เท่านั้น• สิทธิประโยชน์นี้สำหรับเครื่องดื่มขนาด 12 ออนซ์ขึ้นไป ไม่รวมน้ำผลไม้ เครื่องดื่มบรรจุขวดทุกประเภท และเครื่องดื่มแอลกอฮอล์ทุกประเภท• สามารถใช้ได้ที่ทุกร้านสตาร์บัคส์, การซื้อผ่านบริการ Drive Thru, Mobile Order-ahead & Pick Up at Store, Mobile Order to Table และ Starbucks Delivery ยกเว้น foodpanda, Grab, LINE MAN, Robinhood และ ShopeeFood• ไม่สามารถใช้ร่วมกับรายการส่งเสริมการขายอื่นๆ• เงื่อนไขเป็นไปตามที่บริษัทฯกำหนด"
        ]
    },
    {
        "title": "สนุกกับเกม Roblox พร้อมทำ Mission ในเกมสำเร็จ รับเลย! โค้ดส่วนลด ฟรี Customization 1 รายการ (ประเภทใดก็ได้) เมื่อซื้อเครื่องดื่มสตาร์บัคส์ประเภทใด ขนาดใดก็ได้ 1 แก้ว",
        "link": "https://www.starbucks.co.th/th/promotions/roblox-launch-oct-24/",
        "image": "https://www.starbucks.co.th/stb-media/2024/10/Web-promotion-banner-Roblox-Channel-Sign-1080x640-Autumn-24-675x400.webp",
        "date": "1 ต.ค. 67 - 3",
        "details": [
            "เพียงแสดงภาพหน้าจอโค้ดส่วนลดที่ได้จากเกม บนแอปพลิเคชัน Roblox ตามรูปตัวอย่างด้านล่าง",
            "1 ต.ค. 67 – 3 ต.ค. 67",
            "ตัวอย่างโค้ดที่ได้รับจากเกม",
            "เล่นเกมเพื่อรับสิทธิ์ คลิก!https://qr.ilov.io/qpjkai",
            "*กรุณาแสดงภาพหน้าจอรหัสที่ได้รับเมื่อทำภารกิจในเกม Bilberry City บน แอปฟลิเคชัน Roblox สำเร็จ แก่พนักงานก่อนรับสิทธิ์",
            "• สามารถใช้สิทธิ์ได้ที่ร้านสตาร์บัคส์และบริการ Drive Thru ยกเว้น Mobile Order-ahead & Pick Up at Store, Mobile Order to Table และบริการจัดส่งทุกช่องทาง• 1 สิทธิ์/1 Customization/เครื่องดื่ม 1 แก้ว/ใบเสร็จ สามารถใช้ได้สูงสุด 4 สิทธิ์/ท่าน/การซื้อ• เครื่องดื่มสตาร์บัคส์ประเภทใดก็ได้ ได้แก่ เครื่องดื่มสตาร์บัคส์ทุกประเภท, กาแฟ Starbucks Reserve™, เครื่องดื่มไอศกรีมทุกประเภท ยกเว้นน้ำผลไม้ทุกชนิด, เครื่องดื่มบรรจุขวดทุกประเภท และเครื่องดื่มแอลกอฮอล์ทุกประเภท• รหัสนี้ใช้เป็นส่วนลดสำหรับ Customization ฟรี 1 รายการ กรณีเครื่องดื่มมี Customization มากกว่า 1 รายการ จะได้ส่วนลดสำหรับ Customization ที่มีราคาน้อยที่สุด• ไม่สามารถใช้ร่วมกับรายการส่งเสริมการขายอื่นๆ ยกเว้นส่วนลดแก้วส่วนตัว (Personal Cup)• เงื่อนไขเป็นไปตามบริษัทฯ กำหนด"
        ]
    },
    {
        "title": "สมาชิก Starbucks® Rewards ช้อป Starbucks® Rewards STANLEY® Cold Cup (30 ออนซ์) สุดเอ็กซ์คลูซีฟ ดีไซน์พิเศษลายดาวสีทองอันเป็นเอกลักษณ์ (ราคา 1,790 บาท)",
        "link": "https://www.starbucks.co.th/th/promotions/mer-sr-exclusive-collection-sep-24/",
        "image": "https://www.starbucks.co.th/stb-media/2024/09/Digital-EDM-Promotion-Autumn-2-24-Web-Promotion-Banner-1080x640-1-675x400.webp",
        "date": "30 ก.ย. 67 เป็นต้นไป หรือจนกว่าสินค้าจะหมด",
        "details": [
            "30 ก.ย. 67 เป็นต้นไป หรือจนกว่าสินค้าจะหมด",
            "• สิทธิประโยชน์สำหรับสมาชิก Starbucks® Rewards เท่านั้น• จำกัดจำนวนการซื้อ Starbucks® Rewards STANLEY® Cold Cup (30 ออนซ์) 2 ใบต่อสมาชิกในวันที่ 30 ก.ย. 67• สิทธิประโยชน์นี้สามารถใช้ได้ทุกร้านสตาร์บัคส์ ยกเว้น บริการ Drive Thru, Mobile Order-ahead & Pick Up at Store, Mobile Order to Table และบริการจัดส่งทุกช่องทาง• ไม่สามารถใช้ร่วมกับรายการส่งเสริมการขายอื่นๆ• เงื่อนไขเป็นไปตามบริษัทฯ กำหนด"
        ]
    },
    {
        "title": "Starbucks Let’s Get the Magic",
        "link": "https://www.starbucks.co.th/th/promotions/line-e-frequency-vdo-sep-24/",
        "image": "https://www.starbucks.co.th/stb-media/2024/09/Digital-Promotion-LINE-Frequency-Sep-24-Autumn-24-Website-Banner-Promotion-1080x640-1-675x400.webp",
        "date": "23 ก.ย. 67 - 6",
        "details": [
            "เมื่อซื้อเครื่องดื่มสตาร์บัคส์ประเภทใดก็ได้ ขนาด 12 ออนซ์ขึ้นไป 1 แก้ว รับแสตมป์ 1 ดวงผ่าน LINE @StarbucksThailand หรือคลิกhttps://qr.ilov.io/8seh64เพื่อลงทะเบียนร่วมกิจกรรม",
            "สะสมครบทุก 5 ดวง รับ Starbucks Privilege E-Coupon ซื้อเครื่องดื่มสตาร์บัคส์ ประเภทและขนาดใดก็ได้ 1 แก้ว ฟรี 1 แก้ว จำนวน 1 ใบ (สามารถสะสมแสตมป์ได้สูงสุด 10 ดวง เพื่อรับคูปองจำนวน 2 ใบ)",
            "สะสมแสตมป์ตั้งแต่วันที่ 23 ก.ย. 67 – 6 ต.ค. 67ใช้ Starbucks Privilege E-Coupon ได้ตั้งแต่วันที่ 23 ก.ย. 67 – 13 ต.ค. 67 เวลา 23.59 น.",
            "เงื่อนไขในการสะสมแสตมป์• เครื่องดื่มสตาร์บัคส์ประเภทใดก็ได้ ขนาด 12 ออนซ์ขึ้นไป ได้แก่ เครื่องดื่มสตาร์บัคส์ทุกประเภท รวมถึง customization ที่ลูกค้าเลือกและเครื่องดื่มที่ทำจากกาแฟ Reserve ทุกชนิด เครื่องดื่ม Nitro และเครื่องดื่มไอศกรีมทุกประเภท ยกเว้น เครื่องดื่มบรรจุขวด น้ำผลไม้สกัดเย็น และเครื่องดื่มแอลกอฮอล์ทุกประเภท• สามารถสะสมแสตมป์ได้ที่สตาร์บัคส์ทุกสาขา รวมถึงร้านสนามบิน, Drive Thru, บริการ Mobile Order-ahead & Pick Up at Store และบริการ Mobile Order to Table ยกเว้นการซื้อผ่านบริการ Delivery ทุกช่องทาง• เครื่องดื่มที่ได้รับแสตมป์จะต้องเป็นเครื่องดื่มที่ไม่ร่วมโปรโมชั่นใดๆ รวมถึงต้องไม่มีการใช้ Voucher อื่นๆ อยู่ในใบเสร็จนั้น ยกเว้นส่วนลดแก้วส่วนตัว (Personal Cup)• เงื่อนไขเป็นไปตามที่บริษัทฯ กำหนด",
            "เงื่อนไขในการใช้คูปอง• เครื่องดื่มสตาร์บัคส์ประเภทใดก็ได้ ได้แก่ เครื่องดื่มสตาร์บัคส์ทุกประเภท, กาแฟ Starbucks Reserve™, เครื่องดื่มไอศกรีมทุกประเภท รวมเครื่องดื่ม Customization ที่ลูกค้าเลือก ยกเว้นน้ำผลไม้ทุกชนิด, เครื่องดื่มบรรจุขวดทุกประเภท และเครื่องดื่มแอลกอฮอล์ทุกประเภท• คูปองนี้ใช้เป็นส่วนลดสำหรับการซื้อเครื่องดื่มสตาร์บัคส์ขนาดใดก็ได้ 1 แก้ว ฟรี 1 แก้ว ในราคาที่เท่ากับหรือน้อยกว่าแก้วแรกที่ซื้อ• ผู้ที่ได้รับสิทธิ์สามารถใช้คูปองได้ที่ร้านสตาร์บัคส์ทุกสาขา (ยกเว้น บริการ Drive Thru, Mobile Order-ahead & Pick Up at store, Mobile Order to Table และการสั่งซื้อผ่าน Delivery ทุกช่องทาง)• จำกัดจำนวนที่ซื้อท่านละ 1 แก้ว ฟรี 1 แก้ว ซึ่งจะได้รับสูงสุดท่านละ 2 แก้ว/คูปอง• 1 คูปองสามารถใช้ได้เพียง 1 สิทธิ์เท่านั้น• เครื่องดื่มที่ได้รับแสตมป์จะต้องเป็นเครื่องดื่มที่ไม่ร่วมโปรโมชั่นใดๆ หากลูกค้าใช้สิทธิ์คูปอง เครื่องดื่มแก้วที่ลูกค้าจ่ายเงิน จะไม่นับรวมในการสะสมแสตมป์• คูปองนี้ไม่สามารถใช้ร่วมกับส่วนลดอื่นๆ รวมถึงส่วนลดแก้วส่วนตัว (Personal Cup) และไม่สามารถแลกเป็นเงินสดได้• เงื่อนไขเป็นไปตามที่บริษัทฯ กำหนด"
        ]
    },
    {
        "title": "รับกระเป๋าสะพาย Starbucks Two-Tone Tote Bag มูลค่า 700 บาท ฟรี 1 ใบ* เมื่อซื้อสินค้าครบ 750 บาท ขึ้นไปต่อบิล",
        "link": "https://www.starbucks.co.th/th/promotions/gwp-sep-24/",
        "image": "https://www.starbucks.co.th/stb-media/2024/09/Digital-Promotion-GWP-Autumn-24-Website-Banner-Promotion-1080x640--675x400.webp",
        "date": "ตั้งแต่วันที่ 16 ก.ย. 67 -",
        "details": [
            "ตั้งแต่วันที่ 16 ก.ย. 67 – 30 ก.ย. 67 (หรือจนกว่าสินค้าจะหมด)",
            "*Starbucks Two-Tone Tote Bag 1 ใบ ขนาดกว้าง 47.5 ซม. x สูง 30 ซม. (สี Pistachio Green และ Denim Blue)• สิทธิประโยชน์นี้สามารถใช้ได้ที่ร้านสตาร์บัคส์ทุกสาขา และบริการ Drive Thru• ไม่สามารถใช้ร่วมกับบริการจัดส่งทุกประเภท, บริการ Mobile Order-ahead & Pick Up at Store และบริการ Mobile Order to Table• ไม่สามารถใช้ร่วมกับรายการส่งเสริมการขายอื่นๆ และการซื้อเครื่องดื่มแอลกอฮอล์ทุกประเภท"
        ]
    },
    {
        "title": "ร้านที่จำหน่ายเครื่องดื่มใหม่ในรูปแบบ บลอนด์ เอสเพรสโซ่",
        "link": "https://www.starbucks.co.th/th/promotions/selected-stores-that-offer-blonde-espresso-beverages/",
        "image": "https://www.starbucks.co.th/stb-media/2024/09/Banner-Autumn-BLONDE-1080x640-1-675x400.webp",
        "date": "",
        "details": []
    }
]